{"inkVersion":21,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"Fazendeiro":["ev",{"VAR?":"fase_status"},"/ev",["du","ev","str","^Inicio","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.inicio"},{"->":".^.^.^.7"},null]}],["du","ev","str","^Andamento","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.andamento"},{"->":".^.^.^.7"},null]}],["du","ev","str","^Finalizada","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.final"},{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["pop","\n",{"->":".^.^.^.generico"},{"->":".^.^.^.7"},null]}],"nop","\n",{"inicio":["#","^speaker: Inspetor","/#","^Bom dia, senhor. Sou o inspetor que você contratou. Essa é sua propriedade? É uma bela lavoura de arroz.","\n","#","^speaker: Fazendeiro","/#","^Bom dia, sou o Lauro. Obrigado, eu me esforço bastante. A gente tenta, mas ultimamente tá difícil manter ela bonita. O rio não anda mais pra brincadeira.","\n","#","^speaker: Inspetor","/#","^Imagino o trabalho para reconstruir depois da última enchente. Foi muito grave por aqui?","\n","#","^speaker: Fazendeiro","/#","^Grave? A água passou por cima de tudo. Levou taipa, estragou bomba d'água, afogou a lavoura que estava quase no ponto de colher. Grave é pouco. Antigamente, a gente conhecia o rio, sabia até onde ele vinha na cheia. Agora, ele vem com uma fúria que nunca vi. Cada vez que o céu escurece, a gente já fica de orelha em pé.","\n","#","^speaker: Inspetor","/#","^E o que o senhor acha que mudou? É só o volume da chuva?","\n","#","^speaker: Fazendeiro","/#","^A chuva vem um temporal, é verdade. Mas não é só isso. Parece que a terra não segura mais a água. A chuva bate e escorre direto pro rio, que vira um monstro em poucas horas. E quando ele sobe, não tem taipa que segure. A proteção da terra se foi.","\n","#","^speaker: Inspetor","/#","^Seu Lauro, talvez eu possa ajudar. Com as imagens de satélite que tenho aqui, podemos analisar como a água se comportou na sua propriedade e entender melhor os pontos vulneráveis. Se o senhor permitir, podemos olhar juntos.","\n","#","^speaker: Fazendeiro","/#","^É claro! Tudo que puder me ajudar a não passar por aquele pesadelo de novo, eu quero ver.","\n","end",{"#f":1}],"andamento":[["#","^speaker: Fazendeiro","/#","^E então? O que o bicho lá de cima disse?","\n",["ev",{"^->":"Fazendeiro.andamento.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_vegetacao"},"/ev",{"*":".^.^.c-0","flg":3},{"s":["^> Mostrar a diferença de vegetação entre a lavoura e a margem do rio.",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_fogo"},"/ev",{"*":".^.^.c-1","flg":3},{"s":["^> Comentar sobre a ausência de queimadas na área. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_enchente"},"/ev",{"*":".^.^.c-2","flg":3},{"s":["^> Falar sobre a mancha de inundação e como ela avançou.",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_vegetacao"},{"VAR?":"encontrou_fogo"},"&&","/ev",{"*":".^.^.c-3","flg":19},{"s":["^> Conectar a falta de mata ciliar com o caminho da enchente e a vulnerabilidade da lavoura. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Fazendeiro.andamento.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"dialogo_vegetacao"},{"#f":5}],"c-1":["ev",{"^->":"Fazendeiro.andamento.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],{"->":"dialogo_fogo"},"\n",{"#f":5}],"c-2":["ev",{"^->":"Fazendeiro.andamento.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],{"->":"dialogo_enchente"},"\n",{"#f":5}],"c-3":["ev",{"^->":"Fazendeiro.andamento.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],{"->":"dialogo_final"},"\n","end",{"#f":5}]}],{"#f":1}],"final":["#","^speaker: Fazendeiro","/#","^Obrigado pela ajuda bixo la de cima!","\n","end",{"#f":1}],"generico":["#","^speaker: Fazendeiro","/#","^Hmm, não tenho nada novo para te dizer agora.","\n","end",{"#f":1}],"#f":1}],"dialogo_vegetacao":["#","^speaker: Inspetor","/#","^Agora, cruzando com os mapas de vegetação, note algo interessante. Em maio, antes da enchente, sua lavoura estava saudável, com um verde forte. Mas nesta mesma faixa por onde a água avança, a vegetação nativa é muito rala, quase inexistente. Em junho, depois da enchente, essa área fica completamente \"lavada\". Por que essa beira de rio é tão desprotegida?","\n","#","^speaker: Fazendeiro","/#","^Essa terra na beira do rio sempre foi a mais fácil de trabalhar e boa de plantar. A gente sempre se manteve limpa pra aproveitar o máximo de espaço pra lavoura de arroz. Deixar o mato crescer ali sempre pareceu um desperdício.","\n","end",{"#f":1}],"dialogo_fogo":["#","^speaker: Inspetor","/#","^Eu também verifiquei os registros de focos de calor e, como esperado para a sua cultura, não há praticamente nenhuma atividade de queimada na sua propriedade em nenhum dos anos. Seu manejo é todo baseado na água e no preparo mecânico do solo, correto?","\n","#","^speaker: Fazendeiro","/#","^Isso mesmo. Fogo aqui, só na churrasqueira. Na lavoura de arroz, a gente não usa fogo pra nada. O nosso trabalho é com a terra e com a água.","\n","end",{"#f":1}],"dialogo_enchente":["#","^speaker: Inspetor","/#","^Seu Lauro, olhando as imagens da enchente de maio do ano passado e a simulação para este ano, vemos que a água não sobe de forma uniforme. Ela avança com mais força por essa faixa aqui, ao longo da margem, antes de se espalhar pelo resto da lavoura. É como se houvesse um caminho preferencial para a inundação. O senhor reconhece esse padrão?","\n","#","^speaker: Fazendeiro","/#","^A água entra primeiro por ali, com uma força que parece um sangrador. É sempre o primeiro lugar onde as taipas estouram. A gente conserta, mas na cheia seguinte, a história se repete.","\n","end",{"#f":1}],"dialogo_final":["#","^speaker: Inspetor","/#","^Seu Lauro, acho que as imagens estão nos contando a história completa. Aquele \"caminho preferencial\" que a enchente usa para invadir sua lavoura é exatamente a área onde a mata ciliar foi removida. Essa mata nativa na beira do rio não é um desperdício; ela é a primeira linha de defesa. As raízes seguram o barranco e o solo, e a vegetação densa funciona como um quebra-mar, diminuindo a velocidade e a força da água. Sem ela, o rio sobe e avança sem nenhuma barreira, estourando suas taipas e destruindo a lavoura.","\n","#","^speaker: Fazendeiro","/#","^(Ele olha para a margem \"limpa\" do rio, depois para as taipas recém-consertadas, pensativo) Capaz... A gente trabalhou tanto a vida toda pra manter essa beirada limpa, achando que tava fazendo o certo... E era justamente isso que tava deixando a porta aberta pro rio entrar? E o que eu posso fazer agora? Preciso proteger minha lavoura, mas sem perder minha área de plantio.","\n","end",{"#f":1}],"global decl":["ev","str","^Inicio","/str",{"VAR=":"fase_status"},true,{"VAR=":"encontrou_vegetacao"},true,{"VAR=":"encontrou_fogo"},true,{"VAR=":"encontrou_enchente"},"/ev","end",null],"#f":1}],"listDefs":{}}