{"inkVersion":21,"root":[[[["^VARIÁVEIS DA FASE ---","\n",{"->":"0.g-0"},{"#f":5,"#n":"g-0"}],null],["done",{"#f":5,"#n":"g-0"}],null],"done",{"Fazendeiro":["ev",{"VAR?":"fase_status"},"/ev",["du","ev","str","^Inicio","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.inicio"},{"->":".^.^.^.7"},null]}],["du","ev","str","^Andamento","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.andamento"},{"->":".^.^.^.7"},null]}],["du","ev","str","^Finalizada","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.final"},{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["pop","\n",{"->":".^.^.^.generico"},{"->":".^.^.^.7"},null]}],"nop","\n",{"inicio":["#","^speaker: Expert","/#","^Good morning, Mr. Jonas. I'm here as we discussed.","\n","#","^speaker: Jonas","/#","^Good morning. Thanks for coming here. The fields look fine from a distance, but up close, the problem is still here.","\n","#","^speaker: Expert","/#","^You mentioned on the phone you were dealing with some “patches” of low productivity,","\n","^even with the irrigation. Could you show me?","\n","#","^speaker: Jonas","/#","^Yes, that’s right. They’re not exactly patche , more like strips or corridors. The center pivot spreads water evenly, we use top-quality fertilizer, the seed is all the same… but in those strips, the plants just fail to thrive. I’ve tried everything.","\n","#","^speaker: Expert","/#","^I understand your frustration, Mr. Jonas. Sometimes the problem isn’t what’s on the plant, but how the plant is interacting with the soil.","\n","#","^speaker: Expert","/#","^That’s what this technology is for. We’re going to use satellite imagery to take an “x-ray” and understand what’s really happening beneath the surface.","\n","#","^speaker: Jonas","/#","^Perfect. Show me what you’ve got.","\n","end",{"#f":1}],"andamento":[["#","^speaker: Jonas","/#","^What’s up?","\n",["ev",{"^->":"Fazendeiro.andamento.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Not yet Mr.Jonas, I will come back when I find something. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_vegetacao"},"/ev",{"*":".^.^.c-1","flg":3},{"s":["^> Confirme the low-productivity areas with the vegetation map.",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_umidade"},"/ev",{"*":".^.^.c-2","flg":3},{"s":["^> Check if the weak areas are under water stress. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_vegetacao"},{"VAR?":"encontrou_umidade"},"&&","/ev",{"*":".^.^.c-3","flg":19},{"s":["^> Connect the weak areas with pressure loss in the irrigation system. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Fazendeiro.andamento.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"done","\n",{"#f":5}],"c-1":["ev",{"^->":"Fazendeiro.andamento.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"dialogo_vegetacao"},{"#f":5}],"c-2":["ev",{"^->":"Fazendeiro.andamento.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],{"->":"dialogo_umidade"},"\n",{"#f":5}],"c-3":["ev",{"^->":"Fazendeiro.andamento.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],{"->":"dialogo_final"},"\n","end",{"#f":5}]}],{"#f":1}],"final":["#","^speaker: Jonas","/#","^Thank you for the help!","\n","end",{"#f":1}],"generico":["#","^speaker: Jonas","/#","^Hmmm, I don’t have nothing new to say right now…","\n","end",{"#f":1}],"#f":1}],"dialogo_vegetacao":["#","^speaker: Expert","/#","^Mr. Jonas, the satellite confirms exactly what you said. Look here at the crop health ma : we have these areas in dark green, which are very healthy, but right in the middle of them, we have these strips in light green, almost yellow.","\n","#","^speaker: Expert","/#","^The pattern isn’t random; it seems to form corridors. Do you recognize these paths?","\n","#","^speaker: Jonas","/#","^Of course I recognize them! Those strips are where the plants don’t thrive. You can see it clearly from above. I wonder why that happens.","\n","end",{"#f":1}],"dialogo_umidade":["#","^speaker: Expert","/#","^Now, here’s the most intriguing part. This other map measures the moisture in the plants. The areas that were weak on the previous map are the same ones that appear in red here.","\n","#","^speaker: Expert","/#","^This means that even with the pivot irrigator running, the plants in these corridors are thirsty; they aren’t managing to absorb the water properly.","\n","#","^speaker: Jonas","/#","^Thirsty? But I run the pivot every day! The water is there, I can see the ground is wet. How can the plants be thirsty with damp soil?","\n","end",{"#f":1}],"dialogo_final":["#","^speaker: Expert","/#","^Mr.Jonas, I believe the mystery is solved, and the answer was combining the satellite maps with your farm’s design. The strips where your plants are thirsty are the ones farthest from the water pump.","\n","#","^speaker: Expert","/#","^In a large irrigation system like yours, it’s common to have pressure loss along the pipeline. They wet the surface, that’s why you see damp soil, but the water application rate is insufficient to penetrate the soil and meet the crop’s needs.","\n","#","^speaker: Expert","/#","^Your problem isn’t with fertility; it’s with hydraulic engineering.","\n","#","^speaker: Jonas","/#","^You mean the water pressure gets weak by the end of the line? Wow, we calibrate the nozzles, but you never think about the pressure water loses along the way…","\n","#","^speaker: Jonas","/#","^That’s why the crop starts strong and ends weak. And this… can it be fixed? Is it possible to get more pressure into this system?","\n","end",{"#f":1}],"veredito_certo":["^Exactly right! The satellite images pinpointed the problem: the plants in the weak  corridorsare thirsty due to a loss of pressure in the irrigation system.","\n","^Smart irrigation solves this hydraulic engineering issue by replacing the sprinklers at the end of the line with models designed to work efficiently with low pressure.","\n","^This ensures that every plant receives the correct amount of water, eliminating the weak strips and maximizing the entire harvest.","\n","end",{"#f":1}],"veredito_errado":["^Oops! That’s not quite right. Mr. Jonas’s problem isn’t related to nutrient loss or erosion from floods. The satellite data shows his crops are thirsty in very specific strips, even though the ground is wet.","\n","^The issue lies with how the water is being delivered. That’s why Smart Irrigation is the best solution.","\n","end",{"#f":1}],"global decl":["ev","str","^Inicio","/str",{"VAR=":"fase_status"},false,{"VAR=":"encontrou_vegetacao"},false,{"VAR=":"encontrou_umidade"},"/ev","end",null],"#f":1}],"listDefs":{}}