{"inkVersion":21,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"Fazendeiro":["ev",{"VAR?":"fase_status"},"/ev",["du","ev","str","^Inicio","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.inicio"},{"->":".^.^.^.7"},null]}],["du","ev","str","^Andamento","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.andamento"},{"->":".^.^.^.7"},null]}],["du","ev","str","^Finalizada","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.final"},{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["pop","\n",{"->":".^.^.^.generico"},{"->":".^.^.^.7"},null]}],"nop","\n",{"inicio":["#","^speaker: Expert","/#","^Good morning, sir. I’m the Expert you called in. Are you Lauro, the rice farmer?","\n","#","^speaker: Lauro","/#","^Good morning. Yes, I’m Lauro. Thank you for your visit! I’ve called you because, after what happened last year, it’s hard to feel confident. The river… it came like nothing I’ve ever seen.","\n","#","^speaker: Expert","/#","^I can imagine. That flood was devastating. Did it destroy most of your crops?","\n","#","^speaker: Lauro","/#","^It swept through everything. Walls, pumps, and rice almost ready to harvest were all gone. I’ve never seen the river move with such force. Whenever the clouds roll in, I can’t help but worry it might happen again.","\n","#","^speaker: Expert","/#","^It swept through everything. Walls, pumps, and rice almost ready to harvest were all gone. I’ve never seen the river move with such force. Whenever the clouds roll in, I can’t help but worry it might happen again.","\n","#","^speaker: Expert","/#","^Mr. Lauro, I might be able to help. With the satellite images I have here, we can analyze how the water behaved on your property and identify the vulnerable spots. If you allow me, we can look at them together.","\n","#","^speaker: Lauro","/#","^Of course! Anything that can help me avoid that nightmare again, I would like to see.","\n","end",{"#f":1}],"andamento":[["#","^speaker: Lauro","/#","^Then, do you have anything to say?","\n",["ev",{"^->":"Fazendeiro.andamento.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Not yet Mr.Lauro, i will come back when i find something. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_vegetacao"},"/ev",{"*":".^.^.c-1","flg":3},{"s":["^> Link the lack of native vegetation to the region's flood paths.",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_enchente"},"/ev",{"*":".^.^.c-2","flg":3},{"s":["^> Talk about the flood footprint and how it advanced. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_vegetacao"},{"VAR?":"encontrou_enchente"},"&&","/ev",{"*":".^.^.c-3","flg":19},{"s":["^> Connect the lack of native vegetation with the flood's destructive path. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Fazendeiro.andamento.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"done","\n",{"#f":5}],"c-1":["ev",{"^->":"Fazendeiro.andamento.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"dialogo_vegetacao"},{"#f":5}],"c-2":["ev",{"^->":"Fazendeiro.andamento.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],{"->":"dialogo_enchente"},"\n",{"#f":5}],"c-3":["ev",{"^->":"Fazendeiro.andamento.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],{"->":"dialogo_final"},"\n","end",{"#f":5}]}],{"#f":1}],"final":["#","^speaker: Lauro","/#","^Obrigado pela ajuda bixo la de cima!","\n","end",{"#f":1}],"generico":["#","^speaker: Lauro","/#","^Hmm, não tenho nada novo para te dizer agora.","\n","end",{"#f":1}],"#f":1}],"dialogo_vegetacao":["#","^speaker: Expert","/#","^And that makes perfect sense, Mr. Lauro. Because when we analyze the region's vegetation maps, we see a clear pattern: those very \"paths\" the water uses to advance with more force are, most of the time, areas on the riverbank with very weak or non-existent native vegetation.","\n","#","^speaker: Expert","/#","^In contrast to the deep green of the crops, these strips look like fragile scars on the landscape. Would you say the riverbank around here is also like that, more \"clear\"?","\n","#","^speaker: Lauro","/#","^Look, for us it's simple: every square meter counts. The land on the bank is fertile and gets water easily. Letting wild growth take over a piece of ground as good as that? It's like throwing money away. We clear it so we can plant and secure the harvest.","\n","end",{"#f":1}],"dialogo_fogo":["#","^speaker: Expert","/#","^Eu também verifiquei os registros de focos de calor e, como esperado para a sua cultura, não há praticamente nenhuma atividade de queimada na sua propriedade em nenhum dos anos. Seu manejo é todo baseado na água e no preparo mecânico do solo, correto?","\n","#","^speaker: Lauro","/#","^Isso mesmo. Fogo aqui, só na churrasqueira. Na lavoura de arroz, a gente não usa fogo pra nada. O nosso trabalho é com a terra e com a água.","\n","end",{"#f":1}],"dialogo_enchente":["#","^speaker: Expert","/#","^Mr. Lauro, looking at the images from last May's flood and the simulation for this year, we can see the water doesn't rise uniformly.","\n","#","^speaker: Expert","/#","^It pushes forward with more force through this strip here, along the bank, before spreading to the rest of the fields. It's as if there's a preferential path for the flood. Do you recognize this pattern?","\n","#","^speaker: Lauro","/#","^The water always comes in through there first, with a force like a bursting channel. It's always the first place where the levees break. We fix them, but in the next flood, it's the same story all over again.","\n","end",{"#f":1}],"dialogo_final":["#","^speaker: Expert","/#","^Mr. Lauro, I believe the images are telling us the whole story. That \"preferential path\" the flood uses to invade your fields is the exact same area where the riverside vegetation has been cleared.","\n","#","^speaker: Expert","/#","^That native growth on the bank isn't a waste of space; it's your first line of defense. The roots hold the bank and soil together, and the dense plants act as a natural breakwater, slowing the water's speed and reducing its force.","\n","#","^speaker: Expert","/#","^Without it, the river rushes in without any barrier, breaking your levees and destroying the crops.","\n","#","^speaker: Lauro","/#","^(He looks at the \"clear\" riverbank, then at his newly repaired levees, thoughtfully) You don't say... We've worked our whole lives to keep this bank clear, thinking we were doing the right thing...","\n","#","^speaker: Lauro","/#","^And you're telling me that's what was leaving the door wide open for the river? So what can I do now? I need to protect my fields, but without losing my planting area.","\n","end",{"#f":1}],"veredito_certo":["^Excellent! Mr. Lauro's problem is the raw power of the river eroding his land and destroying his crops. Soil Bioengineering is the perfect solution because it uses a living defensive system of plants to create natural barriers.","\n","^These \"root walls\" and \"green breakwaters\" will strengthen the riverbank and reduce the flood's force, protecting his levees and his rice fields for years to come.","\n","end",{"#f":1}],"veredito_errado":["^Oops! That’s not quite right. While those are excellent techniques, Mr. Lauro's main problem isn't soil fertility or inefficient water distribution.","\n","^His farm is being physically destroyed by the force of the river during floods. He needs a solution that can protect his land from being washed away.","\n","end",{"#f":1}],"global decl":["ev","str","^Inicio","/str",{"VAR=":"fase_status"},false,{"VAR=":"encontrou_vegetacao"},false,{"VAR=":"encontrou_enchente"},"/ev","end",null],"#f":1}],"listDefs":{}}