{"inkVersion":21,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"Fazendeiro":["ev",{"VAR?":"fase_status"},"/ev",["du","ev","str","^Inicio","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.inicio"},{"->":".^.^.^.7"},null]}],["du","ev","str","^Andamento","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.andamento"},{"->":".^.^.^.7"},null]}],["du","ev","str","^Finalizada","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.final"},{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["pop","\n",{"->":".^.^.^.generico"},{"->":".^.^.^.7"},null]}],"nop","\n",{"inicio":["#","^speaker: Expert","/#","^Good morning, sir. I’m the Expert. Is this your property? It’s a beautiful piece of land.","\n","#","^speaker: Arlindo","/#","^Good morning. I’m Arlindo. It used to be more beautiful, but these days it’s worn out.","\n","#","^speaker: Expert","/#","^Worn out? What do you mean?","\n","#","^speaker: Arlindo","/#","^Back in the day, we planted and the harvest was plentiful. It was enough to feed the family and still sell a good amount at the market. Now… we can barely get a crop out of it.","\n","#","^speaker: Expert","/#","^And what do you think is happening? Was there not enough rain?","\n","#","^speaker: Arlindo","/#","^Not at all! Rain’s been fine. The problem’s the soil itself — it’s like it’s lost its strength. You plant in the same spot once or twice, and that’s it.","\n","#","^speaker: Expert","/#","^Mr. Arlindo, I can help you! If you’ll allow me, I’d like to take a look at your land using satellite images. Maybe we can find some clues about what’s weakening the soil.","\n","#","^speaker: Arlindo","/#","^Of course! I’d be glad to have your help.","\n","end",{"#f":1}],"andamento":[["#","^speaker: Arlindo","/#","^Then, do you have anything to say?","\n",["ev",{"^->":"Fazendeiro.andamento.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Not yet Mr.Arlindo, i will come back when i find something. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_vegetacao"},"/ev",{"*":".^.^.c-1","flg":3},{"s":["^> Talk about how the vegetation changes between May, July, and August. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_fogo"},"/ev",{"*":".^.^.c-2","flg":3},{"s":["^> Talk about how fire activity changes between May, July, and August. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Fazendeiro.andamento.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"VAR?":"encontrou_vegetacao"},{"VAR?":"encontrou_fogo"},"&&","/ev",{"*":".^.^.c-3","flg":19},{"s":["^> Connect the drop in vegetation with the rise in fires and the problem of “worn out” soil. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Fazendeiro.andamento.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"done","\n",{"#f":5}],"c-1":["ev",{"^->":"Fazendeiro.andamento.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"dialogo_vegetacao"},{"#f":5}],"c-2":["ev",{"^->":"Fazendeiro.andamento.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],{"->":"dialogo_fogo"},"\n",{"#f":5}],"c-3":["ev",{"^->":"Fazendeiro.andamento.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],{"->":"dialogo_final"},"\n","end",{"#f":5}]}],{"#f":1}],"final":["#","^speaker: Arlindo","/#","^Obrigado pela ajuda bixo la de cima!","\n","end",{"#f":1}],"generico":["#","^speaker: Arlindo","/#","^Hmm, não tenho nada novo para te dizer agora.","\n","end",{"#f":1}],"#f":1}],"dialogo_vegetacao":["#","^speaker: Expert","/#","^Every year, we can see that vegetation cover looks very healthy in May, but by July it’s noticeably worse. And in August, there are many spots with little to no vegetation left. What could be the reason for such a drastic drop in vegetation around mid-year?","\n","#","^speaker: Arlindo","/#","^Well, in May we’re just coming out of the rainy season, so everything’s green and full of life. The grass is tall, and the soil still holds plenty of moisture.","\n","#","^speaker: Arlindo","/#","^But by July, we’ve already harvested and started clearing the fields and preparing the soil to get the land ready for the next planting. That’s why the vegetation looks thin and patchy by mid-year.","\n","end",{"#f":1}],"dialogo_fogo":["#","^speaker: Expert","/#","^Looking at the fire activity maps, there’s intense burning in August 2020, but almost none in May or July. Why is there such a big difference between those months?","\n","#","^speaker: Arlindo","/#","^That’s pretty normal for our region. May is still a humid month, right at the end of the rainy season, so the fire risk is low. In July, we start managing the pastures by clearing and cleaning up the fields.","\n","#","^speaker: Arlindo","/#","^Then in August, everything’s dry, and that’s when we use fire to clear the land and prepare the soil for planting.","\n","end",{"#f":1}],"dialogo_final":["#","^speaker: Expert","/#","^In May, vegetation is at its peak, and there’s no fire activity. But as it disappears between July and August, those fire spots start showing up right where the vegetation used to be. You mentioned that the land gets “worn out” and you have to move to new areas…","\n","#","^speaker: Expert","/#","^Could it be that burning the fields every year is actually what’s wearing out and weakening the soil little by little?","\n","#","^speaker: Arlindo","/#","^You might be right, son. We’ve always burned the fields. It’s the only way we know to clear everything and get ready for the next crop.","\n","#","^speaker: Arlindo","/#","^The ash helps fertilize the soil, but after two or three harvests, it’s spent. I don’t like burning, but I don’t really know another way to make this soil work.","\n","end",{"#f":1}],"veredito_certo":["^Well done! Arlindo’s soil isn’t suffering from lack of rain or water, but from nutrient loss over repeated planting and clearing.","\n","^Agroforestry is the best solution because it restores fertility naturally, mixes crops that nourish the soil, attracts beneficial insects, and keeps the land productive for many years, allowing sustainable farming without wearing the soil out.","\n","end",{"#f":1}],"veredito_errado":["^Oops! That’s not quite right. Techniques like Soil Bioengineering or Smart Irrigation can be useful in certain situations. For example, to protect the soil from erosion or to distribute water evenly, but Arlindo’s problem is different.","\n","^His soil is “worn out” because it loses nutrients after a few plantings and harvests. What he really needs is a solution that restores fertility and keeps the land productive for the long term. Try again, thinking about how to bring life back to the soil sustainably.","\n","end",{"#f":1}],"global decl":["ev","str","^Inicio","/str",{"VAR=":"fase_status"},false,{"VAR=":"encontrou_vegetacao"},false,{"VAR=":"encontrou_fogo"},"/ev","end",null],"#f":1}],"listDefs":{}}